Autodesk.Revit.DB.Structure.RebarCouplerError.BendingPlanesAreNotParallel
The bending planes of the connected bars are not parallel.
This will be returned when connecting two shape-driven rebars whose bending planes are not parallel and the bar curves that need to be connected are not aligned.